<?php

return [
    'test_preparation' => [
        'about' => [
            'what_you_get' => 'Что вы получите',
            'talents' => [
                'title' => '24 талант',
                'desc' => 'ProfGid әдістемесі бойынша сіздің күшті жақтарыңызды талдау'
            ],
            'sphere' => [
                'title' => '10 сала',
                'desc' => 'сіздің қабілеттеріңізге сай келетін бағыттар'
            ],
            'profession' => [
                'title' => '10+ мамандық',
                'desc' => 'сіздің профиліңізге барынша сәйкес нақты мамандықтар'
            ],
        ],
    ],
    'payment' => [
        'cards' => [
            'top' => [
                'title' => 'Мои таланты + Профессии',
                'recommendation' => 'Рекомендуемый',
                'price' => '9000',
                'currency' => 'тг',
                'desc_1' => 'Полный анализ всех 24 талантов',
                'desc_2' => 'Сильные и слабые стороны',
                'desc_3' => 'Персональные рекомендации по развитию',
                'desc_4' => 'Подходящие сферы деятельности',
                'desc_5' => 'Список профессий, которые вам подходят',
                'desc_6' => '10 наименее подходящих профессий',
                'desc_7' => 'В процентах (%) — насколько каждая профессия вам подходит',
                'submit_btn' => 'Выбрать лучший план',
                'submit_btn_no_session' => 'Пройти тест и выбрать план',
            ],
            'middle' => [
                'title' => 'Мои Таланты',
                'price' => '3000',
                'currency' => 'тг',
                'desc_1' => 'Полный анализ всех 24 талантов',
                'desc_2' => 'Сильные и слабые стороны',
                'desc_3' => 'Персональные рекомендации по развитию',
                'submit_btn' => 'Выбрать план',
                'submit_btn_no_session' => 'Пройти тест для этого плана',
            ],
            'bottom' => [
                'title' => 'Мои Профессии',
                'price' => '6000',
                'currency' => 'тг',
                'desc_1' => 'Подходящие сферы деятельности',
                'desc_2' => 'Список профессий, которые вам подходяты',
                'desc_3' => '10 наименее подходящих профессий',
                'desc_4' => 'В процентах (%) — насколько каждая профессия вам подходит',
                'submit_btn' => 'Выбрать план',
                'submit_btn_no_session' => 'Пройти тест для этого плана',
            ]
        ]
    ],
    'header' => [
        'about' => 'Біз туралы',
        'professions' => 'Мамандықтар картасы',
        'grant' => 'Грант талдау',
        'my_professions' => 'Менің мамандықтарым',
        'my_spheres' => 'Менің сфераларым'
    ],
    'home' => [
        'top' => [
            'pass_test' => 'Тест тапсыру',
            'text_1' => 'Жеке қабілеттеріңіз бен таланттарыңызды талдау.',
            'text_2' => 'Дәл сізге сай келетін мамандықтарды таңдауға арналған ұсыныстар.',
            'text_3' => 'Сіздің бірегей қасиеттеріңізге негізделген даму тәсілі.',
        ],
        'middle' => [
            'title' => 'Бұл қалай жұмыс істейді?',
            'accordion_1' => [
                'title' => '1. Тесттен өт',
                'desc' => 'Танылған әдістемелерге (Gallup CS34, Gardner MI, MBTI) негізделген тест сұрақтарына жауап бер. Бар болғаны 20 минут уақытыңды алады!'
            ],
            'accordion_2' => [
                'title' => '2. Нәтижені ал',
                'desc' => 'Біз сенің жауаптарыңды талдап, сенің мықты жақтарың, қабілеттерің және әлеуетті қызмет салаларың туралы толық есеп жасаймыз.'
            ],
            'accordion_3' => [
                'title' => '3. Саған сай келетін мамандықтарды зертте',
                'desc' => 'Нәтижелерге сүйене отырып, сен өзіңнің бейнеңе барынша сәйкес келетін мамандықтар тізімін аласың.'
            ],
            'accordion_4' => [
                'title' => 'Сіз не аласыз',
                'desc' => '<li>
                                    Барлық 24 таланттың толық талдауы
                                </li>
                                <li>
                                    Дамудың жеке ұсыныстары
                                </li>
                                <li>
                                    Сізге сәйкес қызмет салалары
                                </li>
                                <li>
                                    Сізге лайық мамандықтар тізімі
                                </li>
                                <li>
                                    Пайыздық көрсеткіш (%) — әр мамандықтың сізге қаншалықты сай келетінін көрсетеді
                                </li>'
            ],
        ],
        'bottom' => [
            'title' => 'Мамандықтар картасы',
            'desc' => 'Мүмкіндіктер әлемін зерттеп, өз кәсіби жолыңды табыңыз.',
            'content' => [
                'title_1' => 'Мамандықтарды зерттеңіз.',
                'desc_1' => 'Қазіргі заманғы мамандықтардың алуан түрлілігін ашып, мансаптық дамуыңыздың көкжиегін кеңейтіңіз.',
                'title_2' => 'Өз жолыңызды табыңыз.',
                'desc_2' => 'Өз қызығушылықтарыңыз бен қалауларыңызды анықтап, сізге ең қолайлы мансаптық бағытты таңдаңыз.',
            ],
            'btn' => 'Мамандықтар картасын ашу'
        ],
    ],
    'footer' => [
        'desc' => 'Кәсіби бағдар беру платформасы, ол сенің мықты жақтарыңды анықтап, саған лайықты мамандық табуға көмектеседі.',
        'navigation' => 'Бағдарлау',
        'main' => 'Басты',
        'how_works' => 'Бұл қалай жұмыс істейді',
        'about' => 'Біз туралы',
        'pass_test' => 'Тесттен өту',
        'resources' => 'Ресурстар',
        'blog' => 'Блог',
        'professions_map' => 'Мамандықтар картасы',
        'universities' => 'Университеттер',
        'faq' => 'FAQ',
        'contacts' => 'Байланыс',
        'rights' => '2025 PROFGID. Барлық құқықтар қорғалған.',
        'payment_conditions' => 'Төлем және қайтару шарттары',
        'contract' => 'Ұсыныс шарты (оферта)',
        'policy' => 'Құпиялық саясаты'
    ],
    'about' => [
        'title' => 'Біз туралы',
        'desc' => 'Біз сізге дәл өзіңізге лайық мамандықты табуға көмектесеміз.',
        'content' => [
            'text_1' => 'ProfGid — бұл адамдарға өздерінің мықты жақтарын анықтауға, лайықты мамандық табуға және табысты мансап құруға көмектесетін кәсіби мамандар тобы.',
            'text_2' => 'Біз әр адамның ашуға және мақсаттарға жетуге бағыттауға болатын ерекше таланттары мен қабілеттері бар екеніне сенеміз. Біздің миссиямыз — адамдарға өзін жақсырақ түсінуге және қанағат пен табыс әкелетін жолды таңдауға көмектесу.',
            'text_3' => 'Біз немен айналысамыз?',
            'text_4' => 'Профориентация: Оқушыларға, студенттерге және ересектерге арналған жеке консультациялар.',
            'text_5' => 'Таланттарды талдау: Gallup CliftonStrengths, MBTI сияқты заманауи әдістерді және халықаралық деңгейде мойындалған басқа да құралдарды қолданамыз.',
            'text_6' => 'Ұсынымдар: Сіздің қызығушылықтарыңыз бен мықты қырларыңызға сәйкес келетін мамандықтар мен қызмет салаларын таңдап береміз.',
            'text_7' => 'Біздің құндылықтарымыз',
            'text_8' => 'Жеке көзқарас: Әрбір адам қайталанбас тұлға, біз өз жұмысымызда мұны ескереміз.',
            'text_9' => 'Шынайылық: Біздің барлық ұсыныстарымыз ғылыми әдістер мен терең талдауларға негізделген.',
            'text_10' => 'Үздіксіз даму: Біз жаңа үрдістерді бақылап, қызметтерімізді жетілдіріп отырамыз.',
            'text_11' => 'ProfGid-пен сіз жай ғана кеңестер емес, өзіңіздің мансаптық мақсаттарыңызға жету үшін нақты іс-қимыл жоспарын аласыз. Біз — мамандықтар мен мүмкіндіктер әлеміндегі сіздің жолсерігіңізбіз!',
        ],
        'footer' => [
            'title' => 'Сұрақтарыңыз бар ма?',
            'desc' => 'Бізбен байланысыңыз, біз сізге түсінуге көмектесеміз.',
        ],
        'cta' => [
            'title' => 'Өз мамандығыңызды табуға дайынсыз ба?',
            'desc' => 'Тесттен өтіп, жеке ұсыныстар алыңыз.',
            'btn' => 'Тесттен өту'
        ]
    ],
    'profession_map' => [
        'title' => 'Мамандықтар картасы',
        'desc' => 'Әртүрлі қызмет салаларын зерттеңіз',
        'professions' => [
            'into' => 'Осы саладағы мамандықтар:',
            'desc' => 'Мамандық сипаттамасы'
        ]
    ],
    'my_professions' => [
        'title' => 'Сақталған мамандықтар',
        'desc' => 'Сіздің сақталған мамандықтарыңыз'
    ],
    'my_spheres' => [
        'title' => 'Сақталған салалар',
        'desc' => 'Сіздің сақталған салалар',
        'professions' => [
            'title' => 'Осы саладағы мамандықтар:'
        ]
    ],
    'result' => [
        'professions' => [
            'desc' => 'Сіздің басты қабілеттеріңізге сүйене отырып, біз сіздің әлеуетіңізге ең сәйкес келетін мамандықтар тізімін жасадық.',
            'least' => [
                'title' => 'Ең аз сәйкес келетін мамандықтар',
                'desc' => 'Бұл – сіздің таланттарыңызбен үйлесімділігі төмен мамандықтар. Бұл салаларда жұмыс істеу көбірек күш-жігерді талап етуі мүмкін және толық қанағат әкелмеуі ықтимал.'
            ]
        ]
    ],
    'test-preparation' => [
        'title' => 'Сіз тест тапсыруға дайынсыз ба',
        'desc' => 'Бастамас бұрын бірнеше маңызды жайттар',
        'instruction_1' => 'Сізде 25-35 минут бос уақытыңыз бар екеніне көз жеткізіңіз',
        'instruction_2' => 'Тест 120 сұрақтан тұрады',
        'instruction_3' => 'Әр сұраққа 20 секундтан артық уақыт жұмсамауға тырысыңыз',
        'instruction_4' => 'Мұнда дұрыс немесе қате жауаптар жоқ – өзіңіз болып қала беріңіз',
        'btn' => 'Тестті бастау'
    ]
];
