<?php

return [
    'test_preparation' => [
        'about' => [
            'what_you_get' => 'Что вы получите',
            'talents' => [
                'title' => '24 талант',
                'desc' => 'ProfGid әдістемесі бойынша сіздің күшті жақтарыңызды талдау'
            ],
            'sphere' => [
                'title' => '10 сала',
                'desc' => 'сіздің қабілеттеріңізге сай келетін бағыттар'
            ],
            'profession' => [
                'title' => '10+ мамандық',
                'desc' => 'сіздің профиліңізге барынша сәйкес нақты мамандықтар'
            ],
        ],
    ]
];
