<?php

return [
    'test_preparation' => [
        'about' => [
            'what_you_get' => 'Что вы получите',
            'talents' => [
                'title' => '24 талантов',
                'desc' => 'разбор ваших сильных сторон по методике ProfGid'
            ],
            'sphere' => [
                'title' => '10 сфер',
                'desc' => 'подходящие направления деятельности'
            ],
            'profession' => [
                'title' => '10+ профессии',
                'desc' => 'конкретные профессии, которые максимально соответствуют вашему профилю'
            ],
        ],
    ],
    'payment' => [
        'cards' => [
            'top' => [
                'title' => 'Мои таланты + Профессии',
                'recommendation' => 'Рекомендуемый',
                'price' => '9000',
                'currency' => 'тг',
                'desc_1' => 'Полный анализ всех 24 талантов',
                'desc_2' => 'Сильные и слабые стороны',
                'desc_3' => 'Персональные рекомендации по развитию',
                'desc_4' => 'Подходящие сферы деятельности',
                'desc_5' => 'Список профессий, которые вам подходят',
                'desc_6' => '10 наименее подходящих профессий',
                'desc_7' => 'В процентах (%) — насколько каждая профессия вам подходит',
                'submit_btn' => 'Выбрать лучший план',
                'submit_btn_no_session' => 'Пройти тест и выбрать план',
            ],
            'middle' => [
                'title' => 'Мои Таланты',
                'price' => '3000',
                'currency' => 'тг',
                'desc_1' => 'Полный анализ всех 24 талантов',
                'desc_2' => 'Сильные и слабые стороны',
                'desc_3' => 'Персональные рекомендации по развитию',
                'submit_btn' => 'Выбрать план',
                'submit_btn_no_session' => 'Пройти тест для этого плана',
            ],
            'bottom' => [
                'title' => 'Мои Профессии',
                'price' => '6000',
                'currency' => 'тг',
                'desc_1' => 'Подходящие сферы деятельности',
                'desc_2' => 'Список профессий, которые вам подходяты',
                'desc_3' => '10 наименее подходящих профессий',
                'desc_4' => 'В процентах (%) — насколько каждая профессия вам подходит',
                'submit_btn' => 'Выбрать план',
                'submit_btn_no_session' => 'Пройти тест для этого плана',
            ]
        ]
    ],
    'header' => [
        'about' => 'О нас',
        'professions' => 'Карта профессии',
        'grant' => 'Грант анализ',
        'my_professions' => 'Мои профессии',
        'my_spheres' => 'Мои сферы'
    ],
    'home' => [
        'top' => [
            'pass_test' => 'Пройти тест',
            'text_1' => 'Индивидуальный разбор твоих талантов и способностей.',
            'text_2' => 'Рекомендации по выбору профессий, которые подходят именно тебе.',
            'text_3' => 'Подход к развитию, основанный на твоих уникальных качествах.',
        ],
        'middle' => [
            'title' => 'Как это работает?',
            'accordion_1' => [
                'title' => '1. Пройди тест',
                'desc' => 'Ответь на вопросы теста, основанного на признанных методиках (Gallup CS34, Gardner MI, MBTI). Это займет всего 20 минут!'
            ],
            'accordion_2' => [
                'title' => '2. Получи результат',
                'desc' => 'Мы анализируем твои ответы и составляем подробный отчет о твоих сильных сторонах, способностях и потенциальных сферах деятельности.'
            ],
            'accordion_3' => [
                'title' => '3. Изучи подходящие профессии',
                'desc' => 'На основе результатов ты получишь список профессий, которые максимально подходят твоему профилю.'
            ],
            'accordion_4' => [
                'title' => 'Что вы получите',
                'desc' => '<li>
                                    Полный анализ всех 24 талантов
                                </li>
                                <li>
                                    Персональные рекомендации по развитию
                                </li>
                                <li>
                                    Подходящие сферы деятельности
                                </li>
                                <li>
                                    Список профессий, которые вам подходят
                                </li>
                                <li>
                                    В процентах (%) — насколько каждая профессия вам подходит
                                </li>'
            ],

        ],
        'bottom' => [
            'title' => 'Карта профессий',
            'desc' => 'Исследуйте мир возможностей и найдите свой профессиональный путь',
            'content' => [
                'title_1' => 'Исследуйте профессии',
                'desc_1' => 'Откройте для себя разнообразие современных профессий и расширьте свои горизонты карьерного развития.',
                'title_2' => 'Найдите свой путь',
                'desc_2' => 'Определите свои интересы и предпочтения, чтобы выбрать наиболее подходящую для вас карьерную траекторию.',
            ],
            'btn' => 'Открыть карту профессий'
        ],
    ],
    'footer' => [
        'desc' => 'Платформа для профориентации, которая поможет определить твои сильные стороны и найти подходящую профессию.',
        'navigation' => 'Навигация',
        'main' => 'Главная',
        'how_works' => 'Как это работает',
        'about' => 'О нас',
        'pass_test' => 'Пройти тест',
        'resources' => 'Ресурсы',
        'blog' => 'Блог',
        'professions_map' => 'Карта профессий',
        'universities' => 'Университеты',
        'faq' => 'FAQ',
        'contacts' => 'Контакты',
        'rights' => '2025 PROFGID. Все права защищены.',
        'payment_conditions' => 'Условия оплаты и возврата',
        'contract' => 'Договор оферты',
        'policy' => 'Политика конфиденциальности'
    ],
    'about' => [
        'title' => 'О нас',
        'desc' => 'Помогаем найти профессию, которая подходит именно вам',
        'content' => [
            'text_1' => 'ProfGid — это команда профессионалов, помогающая людям определить свои сильные стороны, найти подходящую профессию и построить успешную карьеру.',
            'text_2' => 'Мы верим, что у каждого есть уникальные таланты и способности, которые можно раскрыть и направить на достижение целей. Наша миссия — помочь людям лучше понять себя и выбрать путь, который принесёт удовлетворение и успех.',
            'text_3' => 'Чем мы занимаемся?',
            'text_4' => 'Профориентация: Индивидуальные консультации для школьников, студентов и взрослых.',
            'text_5' => 'Анализ талантов: Используем современные методики, такие как тест Gallup CliftonStrengths, MBTI, и другие международно признанные инструменты.',
            'text_6' => 'Рекомендации: Подбор профессий и сфер деятельности, соответствующих вашим интересам и сильным сторонам.',
            'text_7' => 'Наши ценности',
            'text_8' => 'Индивидуальный подход: Каждый человек уникален, и мы учитываем это в своей работе.',
            'text_9' => 'Достоверность: Все наши рекомендации основаны на научных методах и глубоких анализах.',
            'text_10' => 'Постоянное развитие: Мы следим за новыми тенденциями и совершенствуем наши услуги.',
            'text_11' => 'С ProfGid вы получаете не просто советы, а чёткий план действий для достижения ваших карьерных целей. Мы — ваш проводник в мире профессий и возможностей!',
        ],
        'footer' => [
            'title' => 'Есть вопросы?',
            'desc' => 'Свяжитесь с нами, и мы поможем вам разобраться',
        ],
        'cta' => [
            'title' => 'Готовы найти свою профессию?',
            'desc' => 'Пройдите тест и получите персональные рекомендации',
            'btn' => 'Пройти тест'
        ]
    ],
    'profession_map' => [
        'title' => 'Карта профессий',
        'desc' => 'Исследуйте различные сферы деятельности',
        'professions' => [
            'into' => 'Профессии в этой сфере:',
            'desc' => 'Описание профессии'
        ]
    ],
    'my_professions' => [
        'title' => 'Избранные профессии',
        'desc' => 'Ваши сохраненные профессии'
    ],
    'my_spheres' => [
        'title' => 'Избранные сферы',
        'desc' => 'Ваши сохраненные сферы деятельности',
        'professions' => [
            'title' => 'Профессии в этой сфере:'
        ]
    ],
    'result' => [
        'professions' => [
            'desc' => 'На основе ваших топ талантов мы составили список профессий, которые наиболее соответствуют вашему потенциалу.',
            'least' => [
                'title' => 'Наименее подходящие профессии',
                'desc' => 'Эти профессии, которые показали низкую совместимость с вашими талантами. Работа в этих сферах может требовать больше усилий и не приносить полного удовлетворения.'
            ]
        ]
    ],
    'test-preparation' => [
        'title' => 'Вы готовы к прохождению теста',
        'desc' => 'Несколько важных моментов перед началом',
        'instruction_1' => 'Убедитесь, что у вас есть 25-35 минут свободного времени',
        'instruction_2' => 'Тест состоит из 120 вопросов',
        'instruction_3' => 'Старайтесь тратить не более 20 секунд на каждый вопрос',
        'instruction_4' => 'Здесь нет правильных или неправильных ответов - просто будьте собой',
        'btn' => 'Начать тест'
    ]
];
