<?php

return [
    'test_preparation' => [
        'about' => [
            'what_you_get' => 'Что вы получите',
            'talents' => [
                'title' => '24 талантов',
                'desc' => 'разбор ваших сильных сторон по методике ProfGid'
            ],
            'sphere' => [
                'title' => '10 сфер',
                'desc' => 'подходящие направления деятельности'
            ],
            'profession' => [
                'title' => '10+ профессии',
                'desc' => 'конкретные профессии, которые максимально соответствуют вашему профилю'
            ],
        ],
    ],
    'payment' => [
        'cards' => [
            'top' => [
                'title' => 'Мои таланты + Профессии',
                'recommendation' => 'Рекомендуемый',
                'price' => '9000',
                'currency' => 'тг',
                'desc_1' => 'Полный анализ всех 24 талантов',
                'desc_2' => 'Сильные и слабые стороны',
                'desc_3' => 'Персональные рекомендации по развитию',
                'desc_4' => 'Подходящие сферы деятельности',
                'desc_5' => 'Список профессий, которые вам подходят',
                'desc_6' => '10 наименее подходящих профессий',
                'desc_7' => 'В процентах (%) — насколько каждая профессия вам подходит',
                'submit_btn' => 'Выбрать лучший план',
                'submit_btn_no_session' => 'Пройти тест и выбрать план',
            ],
            'middle' => [
                'title' => 'Мои Таланты',
                'price' => '3000',
                'currency' => 'тг',
                'desc_1' => 'Полный анализ всех 24 талантов',
                'desc_2' => 'Сильные и слабые стороны',
                'desc_3' => 'Персональные рекомендации по развитию',
                'submit_btn' => 'Выбрать план',
                'submit_btn_no_session' => 'Пройти тест для этого плана',
            ],
            'bottom' => [
                'title' => 'Мои Профессии',
                'price' => '6000',
                'currency' => 'тг',
                'desc_1' => 'Подходящие сферы деятельности',
                'desc_2' => 'Список профессий, которые вам подходяты',
                'desc_3' => '10 наименее подходящих профессий',
                'desc_4' => 'В процентах (%) — насколько каждая профессия вам подходит',
                'submit_btn' => 'Выбрать план',
                'submit_btn_no_session' => 'Пройти тест для этого плана',
            ]
        ]
    ],
    'header' => [
        'about' => 'О нас',
        'professions' => 'Карта профессии',
        'grant' => 'Грант анализ',
        'my_professions' => 'Мои профессии',
        'my_spheres' => 'Мои сферы'
    ],
    'home' => [
        'top' => [
            'pass_test' => 'Пройти тест',
            'text_1' => 'Индивидуальный разбор твоих талантов и способностей.',
            'text_2' => 'Рекомендации по выбору профессий, которые подходят именно тебе.',
            'text_3' => 'Подход к развитию, основанный на твоих уникальных качествах.',
        ],
        'middle' => [
            'title' => 'Как это работает?',
            'accordion_1' => [
                'title' => 'Пройди тест',
                'desc' => 'Ответь на вопросы теста, основанного на признанных методиках (Gallup CS34, Gardner MI, MBTI). Это займет всего 20 минут!'
            ],
            'accordion_2' => [
                'title' => 'Получи результат',
                'desc' => 'Мы анализируем твои ответы и составляем подробный отчет о твоих сильных сторонах, способностях и потенциальных сферах деятельности.'
            ],
            'accordion_3' => [
                'title' => 'Изучи подходящие профессии',
                'desc' => 'На основе результатов ты получишь список профессий, которые максимально подходят твоему профилю.'
            ],
            'accordion_4' => [
                'title' => 'Что вы получите',
                'desc' => '<li>
                                    Полный анализ всех 24 талантов
                                </li>
                                <li>
                                    Персональные рекомендации по развитию
                                </li>
                                <li>
                                    Подходящие сферы деятельности
                                </li>
                                <li>
                                    Список профессий, которые вам подходят
                                </li>
                                <li>
                                    В процентах (%) — насколько каждая профессия вам подходит
                                </li>'
            ],

        ],
        'bottom' => [
            'title' => 'Карта профессий',
            'desc' => 'Исследуйте мир возможностей и найдите свой профессиональный путь',
            'content' => [
                'title_1' => 'Исследуйте профессии',
                'desc_1' => 'Откройте для себя разнообразие современных профессий и расширьте свои горизонты карьерного развития.',
                'title_2' => 'Найдите свой путь',
                'desc_2' => 'Определите свои интересы и предпочтения, чтобы выбрать наиболее подходящую для вас карьерную траекторию.',
            ],
            'btn' => 'Открыть карту профессий'
        ],
    ],
    'footer' => [
        'desc' => 'Платформа для профориентации, которая поможет определить твои сильные стороны и найти подходящую профессию.',
        'navigation' => 'Навигация',
        'main' => 'Главная',
        'how_works' => 'Как это работает',
        'about' => 'О нас',
        'pass_test' => 'Пройти тест',
        'resources' => 'Ресурсы',
        'blog' => 'Блог',
        'professions_map' => 'Карта профессий',
        'universities' => 'Университеты',
        'faq' => 'FAQ',
        'contacts' => 'Контакты',
        'rights' => '2025 PROFGID. Все права защищены.',
        'payment_conditions' => 'Условия оплаты и возврата',
        'contract' => 'Договор оферты',
        'policy' => 'Политика конфиденциальности'
    ],
];
