<?php

return [
    'test_preparation' => [
        'about' => [
            'what_you_get' => 'Что вы получите',
            'talents' => [
                'title' => '24 талантов',
                'desc' => 'разбор ваших сильных сторон по методике ProfGid'
            ],
            'sphere' => [
                'title' => '10 сфер',
                'desc' => 'подходящие направления деятельности'
            ],
            'profession' => [
                'title' => '10+ профессии',
                'desc' => 'конкретные профессии, которые максимально соответствуют вашему профилю'
            ],
        ],
    ],
    'payment' => [
        'cards' => [
            'top' => [
                'title' => 'Мои таланты + Профессии',
                'recommendation' => 'Рекомендуемый',
                'price' => '9000',
                'currency' => 'тг',
                'desc_1' => 'Полный анализ всех 24 талантов',
                'desc_2' => 'Сильные и слабые стороны',
                'desc_3' => 'Персональные рекомендации по развитию',
                'desc_4' => 'Подходящие сферы деятельности',
                'desc_5' => 'Список профессий, которые вам подходят',
                'desc_6' => '10 наименее подходящих профессий',
                'desc_7' => 'В процентах (%) — насколько каждая профессия вам подходит',
                'submit_btn' => 'Выбрать лучший план',
                'submit_btn_no_session' => 'Пройти тест и выбрать план',
            ],
            'middle' => [
                'title' => 'Мои Таланты',
                'price' => '3000',
                'currency' => 'тг',
                'desc_1' => 'Полный анализ всех 24 талантов',
                'desc_2' => 'Сильные и слабые стороны',
                'desc_3' => 'Персональные рекомендации по развитию',
                'submit_btn' => 'Выбрать план',
                'submit_btn_no_session' => 'Пройти тест для этого плана',
            ],
            'bottom' => [
                'title' => 'Мои Профессии',
                'price' => '6000',
                'currency' => 'тг',
                'desc_1' => 'Подходящие сферы деятельности',
                'desc_2' => 'Список профессий, которые вам подходяты',
                'desc_3' => '10 наименее подходящих профессий',
                'desc_4' => 'В процентах (%) — насколько каждая профессия вам подходит',
                'submit_btn' => 'Выбрать план',
                'submit_btn_no_session' => 'Пройти тест для этого плана',
            ]
        ]
    ]
];
